{
  "auto_mapping": null,
  "base_model_name_or_path": "facebook/opt-350m",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 10,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "RANDOM",
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "facebook/opt-350m"
}